Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/bluetooth/examples/digital_key_car_anchor_cs/rssi_filter.c
/*! *********************************************************************************
* \file rssi_filter.c
*
* \brief  RSSI filtering for KW47 keyless entry system
*         MISRA C:2012 / AUTOSAR coding guidelines compliant.
*         Pipeline: Hampel -> Adaptive EMA -> Feature Extraction -> State Machine
*         Fixed-point Q4 throughout. No float. No dynamic memory.
*
* Copyright 2025
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/

#include "rssi_filter.h"
#include "FunctionLib.h"
#include "fsl_component_timer_manager.h"

/************************************************************************************
*************************************************************************************
* Private helper declarations
*************************************************************************************
************************************************************************************/

/* Wrap-safe time difference: returns (a - b) as uint32_t, OK across 32-bit wrap */
static uint32_t RssiFilter_TimeDiff(uint32_t a, uint32_t b);

/* Ring buffer helpers */
static uint16_t RssiFilter_RingNext(uint16_t idx, uint16_t cap);
static uint16_t RssiFilter_RingTail(uint16_t head, uint16_t count, uint16_t cap);

/* Q4 conversion */
static int16_t  RssiFilter_DbmToQ4(int8_t dbm);
static int8_t   RssiFilter_Q4ToDbm(int16_t q4);

/* Q15 multiply: alpha(Q15) * delta(Q4) -> Q4 */
static int16_t  RssiFilter_MulQ15Q4(uint16_t alphaQ15, int16_t deltaQ4);

/* Deterministic insertion sort for int16_t arrays (N bounded by buffer cap) */
static void     RssiFilter_SortS16(int16_t *pArr, uint16_t n);

/* Median of sorted array */
static int16_t  RssiFilter_MedianS16(const int16_t *pSorted, uint16_t n);

/* Integer sqrt (deterministic, no float) */
static uint16_t RssiFilter_IsqrtU32(uint32_t x);

/* Ring buffer operations */
static void     RssiFilter_RawPush(rssiFilter_t *pCtx, uint32_t tMs, int8_t rssiDbm);
static void     RssiFilter_SmoothPush(rssiFilter_t *pCtx, uint32_t tMs, int16_t rssiQ4);
static void     RssiFilter_RawPrune(rssiFilter_t *pCtx, uint32_t nowMs, uint32_t winMs);
static void     RssiFilter_SmoothPrune(rssiFilter_t *pCtx, uint32_t nowMs, uint32_t winMs);

/* Copy time-windowed samples into scratch array (Q4) */
static uint16_t RssiFilter_CopyRawWindowQ4(const rssiFilter_t *pCtx,
                                           uint32_t nowMs, uint32_t winMs,
                                           int16_t *pOut, uint16_t cap);
static uint16_t RssiFilter_CopySmoothWindowQ4(const rssiFilter_t *pCtx,
                                              uint32_t nowMs, uint32_t winMs,
                                              int16_t *pOut, uint16_t cap,
                                              int16_t *pLastQ4);

/* Pipeline stages */
static uint8_t  RssiFilter_HampelReject(rssiFilter_t *pCtx, uint32_t nowMs, int16_t *pOutQ4);
static void     RssiFilter_EmaUpdate(rssiFilter_t *pCtx, uint32_t nowMs, int16_t xQ4);
static uint8_t  RssiFilter_ComputeFeatures(rssiFilter_t *pCtx, uint32_t nowMs);
static rssiEvent_t RssiFilter_StateStep(rssiFilter_t *pCtx, uint32_t nowMs);

/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
* \brief     Initialize RSSI filter (all stages reset)
********************************************************************************** */
void RssiFilter_Init(rssiFilter_t *pFilter)
{
    if (pFilter == NULL)
    {
        return;
    }

    /* Raw ring */
    FLib_MemSet(&pFilter->raw, 0, sizeof(rssiRawRing_t));

    /* Smooth ring */
    FLib_MemSet(&pFilter->smooth, 0, sizeof(rssiSmoothRing_t));

    /* EMA */
    pFilter->emaValid  = 0U;
    pFilter->emaQ4     = (int16_t)(-100 * 16);
    pFilter->emaPrevMs = 0U;

    /* State machine */
    pFilter->currentState      = RssiState_Idle_c;
    pFilter->previousState     = RssiState_Idle_c;
    pFilter->tCandidateStartMs = 0U;
    pFilter->tBelowExitStartMs = 0U;
    pFilter->tLockoutUntilMs   = 0U;
    pFilter->stateChanged      = 0U;
    pFilter->lastEvent         = RssiEvent_None_c;

    /* Features */
    FLib_MemSet(&pFilter->features, 0, sizeof(rssiFeatures_t));
    pFilter->lastUpdateTime = 0U;

    /* Scratch arrays zeroed implicitly by memset if struct is static,
     * but we do not rely on that — they are written before read. */
}

/*! *********************************************************************************
* \brief     Push raw RSSI sample and run full pipeline
********************************************************************************** */
void RssiFilter_AddMeasurement(rssiFilter_t *pFilter, int8_t rssi)
{
    int16_t xQ4;
    int16_t emaQ4Out;
    uint8_t hampelOk;
    rssiEvent_t ev;
    uint32_t nowMs;

    if (pFilter == NULL)
    {
        return;
    }

    nowMs = TM_GetTimestamp();

    /* Clamp input (MISRA: defensive) */
    if (rssi < (int8_t)-127)
    {
        rssi = (int8_t)-127;
    }
    else if (rssi > (int8_t)20)
    {
        rssi = (int8_t)20;
    }
    else
    {
        /* No clamp needed */
    }

    /* Push raw sample */
    RssiFilter_RawPush(pFilter, nowMs, rssi);

    /* Prune old samples */
    RssiFilter_RawPrune(pFilter, nowMs, (uint32_t)RSSI_HAMPEL_WIN_MS * 2U);
    RssiFilter_SmoothPrune(pFilter, nowMs, (uint32_t)RSSI_FEAT_WIN_MS);

