Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/bluetooth/examples/digital_key_car_anchor_cs/rssi_filter.c
    /* Stage 1: Hampel spike rejection */
    hampelOk = RssiFilter_HampelReject(pFilter, nowMs, &xQ4);
    if (hampelOk == 0U)
    {
        pFilter->lastUpdateTime = nowMs;
        return;  /* Not enough data yet */
    }

    /* Stage 2: Adaptive EMA */
    RssiFilter_EmaUpdate(pFilter, nowMs, xQ4);
    emaQ4Out = pFilter->emaQ4;

    /* Push smoothed to smooth ring */
    RssiFilter_SmoothPush(pFilter, nowMs, emaQ4Out);
    RssiFilter_SmoothPrune(pFilter, nowMs, (uint32_t)RSSI_FEAT_WIN_MS);

    /* Stage 3: Feature extraction */
    (void)RssiFilter_ComputeFeatures(pFilter, nowMs);

    /* Stage 4: State machine */
    {
        rssiState_t prevSt = pFilter->currentState;
        ev = RssiFilter_StateStep(pFilter, nowMs);

        /* Only overwrite lastEvent when an actual event fires */
        if (ev != RssiEvent_None_c)
        {
            pFilter->lastEvent = ev;
        }

        if (pFilter->currentState != prevSt)
        {
            pFilter->stateChanged = 1U;
        }
    }

    pFilter->lastUpdateTime = nowMs;
}

/*! *********************************************************************************
* \brief     Get current filtered RSSI (EMA output, integer dBm)
********************************************************************************** */
int8_t RssiFilter_GetFilteredRssi(const rssiFilter_t *pFilter)
{
    if (pFilter == NULL)
    {
        return (int8_t)-100;
    }

    if (pFilter->emaValid != 0U)
    {
        return RssiFilter_Q4ToDbm(pFilter->emaQ4);
    }

    return (int8_t)-100;
}

/*! *********************************************************************************
* \brief     Get current proximity state
********************************************************************************** */
rssiState_t RssiFilter_GetState(const rssiFilter_t *pFilter)
{
    if (pFilter == NULL)
    {
        return RssiState_Idle_c;
    }

    return pFilter->currentState;
}

/*! *********************************************************************************
* \brief     Check and clear the state-changed flag
********************************************************************************** */
bool_t RssiFilter_HasStateChanged(rssiFilter_t *pFilter)
{
    bool_t changed;

    if (pFilter == NULL)
    {
        return (bool_t)FALSE;
    }

    changed = (pFilter->stateChanged != 0U) ? (bool_t)TRUE : (bool_t)FALSE;
    pFilter->stateChanged = 0U;
    return changed;
}

/*! *********************************************************************************
* \brief     Reset filter to initial state
********************************************************************************** */
void RssiFilter_Reset(rssiFilter_t *pFilter)
{
    if (pFilter == NULL)
    {
        return;
    }

    RssiFilter_Init(pFilter);
}

/*! *********************************************************************************
* \brief     Get feature extraction results for diagnostics
*            Converts internal Q4/Q15 to user-friendly units at the API boundary.
********************************************************************************** */
void RssiFilter_GetFeatures(const rssiFilter_t *pFilter, uint16_t *pStdQ4,
                            uint8_t *pPctAbove, int8_t *pMean)
{
    if (pFilter == NULL)
    {
        return;
    }

    if (pStdQ4 != NULL)
    {
        *pStdQ4 = pFilter->features.stdQ4;
    }

    if (pPctAbove != NULL)
    {
        /* Convert Q15 fraction to percentage (0..100) */
        *pPctAbove = (uint8_t)(((uint32_t)pFilter->features.pctAboveQ15 * 100U) / (uint32_t)RSSI_Q15_ONE);
    }

    if (pMean != NULL)
    {
        if (pFilter->features.n > 0U)
        {
            *pMean = RssiFilter_Q4ToDbm(pFilter->features.lastQ4);
        }
        else
        {
            *pMean = (int8_t)-100;
        }
    }
}

/*! *********************************************************************************
* \brief     Get last event emitted by state machine
********************************************************************************** */
rssiEvent_t RssiFilter_GetLastEvent(const rssiFilter_t *pFilter)
{
    if (pFilter == NULL)
    {
        return RssiEvent_None_c;
    }

    return pFilter->lastEvent;
}

/************************************************************************************
*************************************************************************************
* Private utility functions
*************************************************************************************
************************************************************************************/

static uint32_t RssiFilter_TimeDiff(uint32_t a, uint32_t b)
{
    return (uint32_t)(a - b);
}

static uint16_t RssiFilter_RingNext(uint16_t idx, uint16_t cap)
{
    idx++;
    if (idx >= cap)
    {
        idx = 0U;
    }
    return idx;
}

static uint16_t RssiFilter_RingTail(uint16_t head, uint16_t count, uint16_t cap)
{
    uint32_t h = (uint32_t)head;
    uint32_t c = (uint32_t)count;
    uint32_t t = (h + (uint32_t)cap - (c % (uint32_t)cap)) % (uint32_t)cap;
    return (uint16_t)t;
}

static int16_t RssiFilter_DbmToQ4(int8_t dbm)
{
    return (int16_t)((int16_t)dbm * RSSI_Q4_SCALE);
}

static int8_t RssiFilter_Q4ToDbm(int16_t q4)
{
    /* Round toward zero */
    int16_t rounded;
    if (q4 >= (int16_t)0)
    {
        rounded = (int16_t)((q4 + (int16_t)8) / RSSI_Q4_SCALE);
    }
    else
    {
        rounded = (int16_t)((q4 - (int16_t)8) / RSSI_Q4_SCALE);
    }
    return (int8_t)rounded;
}

static int16_t RssiFilter_MulQ15Q4(uint16_t alphaQ15, int16_t deltaQ4)
{
    int32_t prod = (int32_t)alphaQ15 * (int32_t)deltaQ4;
    return (int16_t)(prod >> 15);
}

static void RssiFilter_SortS16(int16_t *pArr, uint16_t n)
{
    uint16_t i;
    for (i = 1U; i < n; i++)
    {
        int16_t key = pArr[i];
        uint16_t j = i;
        while ((j > 0U) && (pArr[j - 1U] > key))
        {
            pArr[j] = pArr[j - 1U];
            j--;
        }
        pArr[j] = key;
    }
}

static int16_t RssiFilter_MedianS16(const int16_t *pSorted, uint16_t n)
{
    return pSorted[n >> 1U];
}

