Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/bluetooth/examples/digital_key_car_anchor_cs/rssi_filter.c
static uint16_t RssiFilter_IsqrtU32(uint32_t x)
{
    uint32_t op  = x;
    uint32_t res = 0U;
    uint32_t one = 1UL << 30;

    while (one > op)
    {
        one >>= 2;
    }

    while (one != 0U)
    {
        if (op >= (res + one))
        {
            op  -= (res + one);
            res  = res + (2U * one);
        }
        res >>= 1;
        one >>= 2;
    }

    return (uint16_t)res;
}

/************************************************************************************
*************************************************************************************
* Ring buffer operations
*************************************************************************************
************************************************************************************/

static void RssiFilter_RawPush(rssiFilter_t *pCtx, uint32_t tMs, int8_t rssiDbm)
{
    pCtx->raw.tMs[pCtx->raw.head]     = tMs;
    pCtx->raw.rssiDbm[pCtx->raw.head] = rssiDbm;
    pCtx->raw.head = RssiFilter_RingNext(pCtx->raw.head, (uint16_t)RSSI_RAW_CAP);

    if (pCtx->raw.count < (uint16_t)RSSI_RAW_CAP)
    {
        pCtx->raw.count++;
    }
}

static void RssiFilter_SmoothPush(rssiFilter_t *pCtx, uint32_t tMs, int16_t rssiQ4)
{
    pCtx->smooth.tMs[pCtx->smooth.head]     = tMs;
    pCtx->smooth.rssiQ4[pCtx->smooth.head]  = rssiQ4;
    pCtx->smooth.head = RssiFilter_RingNext(pCtx->smooth.head, (uint16_t)RSSI_SMOOTH_CAP);

    if (pCtx->smooth.count < (uint16_t)RSSI_SMOOTH_CAP)
    {
        pCtx->smooth.count++;
    }
}

static void RssiFilter_RawPrune(rssiFilter_t *pCtx, uint32_t nowMs, uint32_t winMs)
{
    uint16_t tail;
    uint16_t remaining;
    uint32_t minT;

    if (pCtx->raw.count == 0U)
    {
        return;
    }

    tail = RssiFilter_RingTail(pCtx->raw.head, pCtx->raw.count, (uint16_t)RSSI_RAW_CAP);
    remaining = pCtx->raw.count;
    minT = (RssiFilter_TimeDiff(nowMs, 0U) >= winMs) ? (nowMs - winMs) : 0U;

    while (remaining > 0U)
    {
        if (pCtx->raw.tMs[tail] >= minT)
        {
            break;
        }
        tail = RssiFilter_RingNext(tail, (uint16_t)RSSI_RAW_CAP);
        remaining--;
    }

    pCtx->raw.count = remaining;
}

static void RssiFilter_SmoothPrune(rssiFilter_t *pCtx, uint32_t nowMs, uint32_t winMs)
{
    uint16_t tail;
    uint16_t remaining;
    uint32_t minT;

    if (pCtx->smooth.count == 0U)
    {
        return;
    }

    tail = RssiFilter_RingTail(pCtx->smooth.head, pCtx->smooth.count, (uint16_t)RSSI_SMOOTH_CAP);
    remaining = pCtx->smooth.count;
    minT = (RssiFilter_TimeDiff(nowMs, 0U) >= winMs) ? (nowMs - winMs) : 0U;

    while (remaining > 0U)
    {
        if (pCtx->smooth.tMs[tail] >= minT)
        {
            break;
        }
        tail = RssiFilter_RingNext(tail, (uint16_t)RSSI_SMOOTH_CAP);
        remaining--;
    }

    pCtx->smooth.count = remaining;
}

static uint16_t RssiFilter_CopyRawWindowQ4(const rssiFilter_t *pCtx,
                                           uint32_t nowMs, uint32_t winMs,
                                           int16_t *pOut, uint16_t cap)
{
    uint16_t n = 0U;
    uint16_t idx;
    uint16_t i;
    uint32_t minT;

    if (pCtx->raw.count == 0U)
    {
        return 0U;
    }

    minT = (RssiFilter_TimeDiff(nowMs, 0U) >= winMs) ? (nowMs - winMs) : 0U;
    idx = RssiFilter_RingTail(pCtx->raw.head, pCtx->raw.count, (uint16_t)RSSI_RAW_CAP);

    for (i = 0U; i < pCtx->raw.count; i++)
    {
        if ((pCtx->raw.tMs[idx] >= minT) && (n < cap))
        {
            pOut[n] = RssiFilter_DbmToQ4(pCtx->raw.rssiDbm[idx]);
            n++;
        }
        idx = RssiFilter_RingNext(idx, (uint16_t)RSSI_RAW_CAP);
    }

    return n;
}

static uint16_t RssiFilter_CopySmoothWindowQ4(const rssiFilter_t *pCtx,
                                              uint32_t nowMs, uint32_t winMs,
                                              int16_t *pOut, uint16_t cap,
                                              int16_t *pLastQ4)
{
    uint16_t n = 0U;
    uint16_t idx;
    uint16_t i;
    uint32_t minT;
    int16_t last = 0;

    if (pCtx->smooth.count == 0U)
    {
        *pLastQ4 = 0;
        return 0U;
    }

    minT = (RssiFilter_TimeDiff(nowMs, 0U) >= winMs) ? (nowMs - winMs) : 0U;
    idx = RssiFilter_RingTail(pCtx->smooth.head, pCtx->smooth.count, (uint16_t)RSSI_SMOOTH_CAP);

    for (i = 0U; i < pCtx->smooth.count; i++)
    {
        if ((pCtx->smooth.tMs[idx] >= minT) && (n < cap))
        {
            pOut[n] = pCtx->smooth.rssiQ4[idx];
            last = pCtx->smooth.rssiQ4[idx];
            n++;
        }
        idx = RssiFilter_RingNext(idx, (uint16_t)RSSI_SMOOTH_CAP);
    }

    *pLastQ4 = last;
    return n;
}

/************************************************************************************
*************************************************************************************
* Stage 1: Hampel spike rejection (time-windowed, Q4, with MAD floor)
*************************************************************************************
************************************************************************************/

static uint8_t RssiFilter_HampelReject(rssiFilter_t *pCtx, uint32_t nowMs, int16_t *pOutQ4)
{
    uint16_t n;
    int16_t medQ4;
    int16_t madQ4;
    int32_t prodQ8;
    int32_t thrQ8;
    int16_t thrQ4;
    uint16_t lastIdx;
    int16_t xLatestQ4;
    int16_t diff;
    int16_t absDiff;
    uint16_t i;

    n = RssiFilter_CopyRawWindowQ4(pCtx, nowMs, (uint32_t)RSSI_HAMPEL_WIN_MS,
                                   pCtx->tmpA, (uint16_t)RSSI_RAW_CAP);
    if (n < 3U)
    {
        return 0U;  /* Not enough data */
    }

    /* Sort and find median */
    RssiFilter_SortS16(pCtx->tmpA, n);
    medQ4 = RssiFilter_MedianS16(pCtx->tmpA, n);

    /* Compute MAD = median(|Xi - median|) */
    for (i = 0U; i < n; i++)
    {
        int16_t d = (int16_t)(pCtx->tmpA[i] - medQ4);
        pCtx->tmpB[i] = (d < (int16_t)0) ? (int16_t)(-d) : d;
    }
    RssiFilter_SortS16(pCtx->tmpB, n);
    madQ4 = RssiFilter_MedianS16(pCtx->tmpB, n);

    if (madQ4 < (int16_t)RSSI_MAD_EPS_Q4)
    {
        madQ4 = (int16_t)RSSI_MAD_EPS_Q4;
    }

    /* threshold = K * 1.5 * MAD  (K is Q4, MAD is Q4 => product is Q8) */
    prodQ8 = (int32_t)RSSI_HAMPEL_K_Q4 * (int32_t)madQ4;
    thrQ8  = (prodQ8 * (int32_t)3) / (int32_t)2;
    thrQ4  = (int16_t)(thrQ8 / (int32_t)RSSI_Q4_SCALE);

    /* Get latest raw sample in Q4 */
    lastIdx = (pCtx->raw.head == 0U)
              ? ((uint16_t)RSSI_RAW_CAP - 1U)
              : (uint16_t)(pCtx->raw.head - 1U);
    xLatestQ4 = RssiFilter_DbmToQ4(pCtx->raw.rssiDbm[lastIdx]);

    diff    = (int16_t)(xLatestQ4 - medQ4);
    absDiff = (diff < (int16_t)0) ? (int16_t)(-diff) : diff;

    *pOutQ4 = (absDiff > thrQ4) ? medQ4 : xLatestQ4;
    return 1U;  /* Success */
}

/************************************************************************************
*************************************************************************************
* Stage 2: Adaptive EMA (Q4, dt-based alpha, time anomaly handling)
*************************************************************************************
************************************************************************************/

