Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/bluetooth/examples/digital_key_car_anchor_cs/rssi_filter.c
static void RssiFilter_EmaUpdate(rssiFilter_t *pCtx, uint32_t nowMs, int16_t xQ4)
{
    uint32_t dtMs;
    uint16_t alphaQ15;
    int16_t deltaQ4;
    int16_t stepQ4;

    if (pCtx->emaValid == 0U)
    {
        pCtx->emaValid  = 1U;
        pCtx->emaQ4     = xQ4;
        pCtx->emaPrevMs = nowMs;
        return;
    }

    dtMs = RssiFilter_TimeDiff(nowMs, pCtx->emaPrevMs);

    /* Time anomaly: full reset (safety-first) */
    if ((dtMs == 0U) || (dtMs > (uint32_t)RSSI_EMA_ANOMALY_DT_MS))
    {
        pCtx->emaQ4     = xQ4;
        pCtx->emaPrevMs = nowMs;
        return;
    }

    /* Interpolate alpha in Q15 from dt */
    if (dtMs <= (uint32_t)RSSI_EMA_DT_MIN_MS)
    {
        alphaQ15 = (uint16_t)RSSI_EMA_ALPHA_MIN_Q15;
    }
    else if (dtMs >= (uint32_t)RSSI_EMA_DT_MAX_MS)
    {
        alphaQ15 = (uint16_t)RSSI_EMA_ALPHA_MAX_Q15;
    }
    else
    {
        /* Linear interpolation */
        uint32_t range  = (uint32_t)RSSI_EMA_ALPHA_MAX_Q15 - (uint32_t)RSSI_EMA_ALPHA_MIN_Q15;
        uint32_t dtOff  = dtMs - (uint32_t)RSSI_EMA_DT_MIN_MS;
        uint32_t dtSpan = (uint32_t)RSSI_EMA_DT_MAX_MS - (uint32_t)RSSI_EMA_DT_MIN_MS;
        alphaQ15 = (uint16_t)((uint32_t)RSSI_EMA_ALPHA_MIN_Q15 + ((range * dtOff) / dtSpan));
    }

    /* EMA step: ema += alpha * (x - ema) */
    deltaQ4 = (int16_t)(xQ4 - pCtx->emaQ4);
    stepQ4  = RssiFilter_MulQ15Q4(alphaQ15, deltaQ4);
    pCtx->emaQ4     = (int16_t)(pCtx->emaQ4 + stepQ4);
    pCtx->emaPrevMs = nowMs;
}

/************************************************************************************
*************************************************************************************
* Stage 3: Feature extraction (pctAbove + stdDev, deterministic, Q4)
*************************************************************************************
************************************************************************************/

static uint8_t RssiFilter_ComputeFeatures(rssiFilter_t *pCtx, uint32_t nowMs)
{
    uint16_t n;
    int16_t lastQ4 = 0;
    int64_t sumQ4  = 0;
    int64_t sumSqQ8 = 0;
    uint32_t cntAbove = 0U;
    int16_t mn;
    int16_t mx;
    uint16_t i;
    uint16_t stdQ4 = 0U;

    n = RssiFilter_CopySmoothWindowQ4(pCtx, nowMs, (uint32_t)RSSI_FEAT_WIN_MS,
                                      pCtx->tmpS, (uint16_t)RSSI_SMOOTH_CAP, &lastQ4);

    if (n < (uint16_t)RSSI_MIN_FEAT_SAMPLES)
    {
        pCtx->features.n            = n;
        pCtx->features.pctAboveQ15  = 0U;
        pCtx->features.stdQ4        = 0xFFFFU;
        pCtx->features.lastQ4       = lastQ4;
        pCtx->features.minQ4        = lastQ4;
        pCtx->features.maxQ4        = lastQ4;
        return 0U;  /* Not enough data */
    }

    mn = pCtx->tmpS[0];
    mx = pCtx->tmpS[0];

    for (i = 0U; i < n; i++)
    {
        int16_t xQ4 = pCtx->tmpS[i];
        sumQ4  += (int64_t)xQ4;
        sumSqQ8 += (int64_t)xQ4 * (int64_t)xQ4;

        if (xQ4 >= (int16_t)RSSI_ENTER_NEAR_Q4)
        {
            cntAbove++;
        }
        if (xQ4 < mn) { mn = xQ4; }
        if (xQ4 > mx) { mx = xQ4; }
    }

    /* Variance in Q8: (sumSq - sum^2/n) / (n-1) */
    if (n > 1U)
    {
        int64_t meanSqTerm = (sumQ4 * sumQ4) / (int64_t)n;
        int64_t diffV = sumSqQ8 - meanSqTerm;
        if (diffV < (int64_t)0) { diffV = 0; }
        uint32_t varQ8 = (uint32_t)(diffV / (int64_t)(n - 1U));
        stdQ4 = RssiFilter_IsqrtU32(varQ8);
    }
    else
    {
        stdQ4 = 0xFFFFU;
    }

    pCtx->features.n            = n;
    pCtx->features.pctAboveQ15  = (uint16_t)((cntAbove * (uint32_t)RSSI_Q15_ONE) / (uint32_t)n);
    pCtx->features.stdQ4        = stdQ4;
    pCtx->features.lastQ4       = lastQ4;
    pCtx->features.minQ4        = mn;
    pCtx->features.maxQ4        = mx;
    return 1U;  /* Success */
}

/************************************************************************************
*************************************************************************************
* Stage 4: State machine — FAR / CANDIDATE / LOCKOUT
*
* FAR (Locked):
*   lastQ4 >= enterNearQ4 -> CANDIDATE (event: CandidateStarted)
*
* CANDIDATE (Approach):
*   Stable for stableMs AND features pass -> LOCKOUT (event: UnlockTriggered)
*   lastQ4 < exitNearQ4 for exitConfirmMs -> FAR (event: ExitToFar)
*
* LOCKOUT (Unlocked):
*   Wait lockoutMs, then:
*     lastQ4 < exitNearQ4 for exitConfirmMs -> FAR (event: ExitToFar)
*************************************************************************************
************************************************************************************/

static rssiEvent_t RssiFilter_StateStep(rssiFilter_t *pCtx, uint32_t nowMs)
{
    int16_t lastQ4  = pCtx->features.lastQ4;
    uint8_t isStable;

    /* ---- LOCKOUT state ---- */
    if (pCtx->currentState == RssiState_Unlocked_c)
    {
        /* Still in lockout period? */
        if (nowMs < pCtx->tLockoutUntilMs)
        {
            return RssiEvent_None_c;
        }

        /* Lockout expired: check if signal dropped */
        if (lastQ4 < (int16_t)RSSI_EXIT_NEAR_Q4)
        {
            if (pCtx->tBelowExitStartMs == 0U)
            {
                pCtx->tBelowExitStartMs = nowMs;
            }

            if (RssiFilter_TimeDiff(nowMs, pCtx->tBelowExitStartMs) >= (uint32_t)RSSI_EXIT_CONFIRM_MS)
            {
                pCtx->previousState     = pCtx->currentState;
                pCtx->currentState      = RssiState_Locked_c;
                pCtx->tBelowExitStartMs = 0U;
                return RssiEvent_ExitToFar_c;
            }
        }
        else
        {
            pCtx->tBelowExitStartMs = 0U;
        }

        return RssiEvent_None_c;
    }

    /* ---- IDLE state ---- */
    if (pCtx->currentState == RssiState_Idle_c)
    {
        if (pCtx->emaValid != 0U)
        {
            pCtx->previousState = pCtx->currentState;
            pCtx->currentState  = RssiState_Locked_c;
        }
        return RssiEvent_None_c;
    }

    /* ---- FAR state ---- */
    if (pCtx->currentState == RssiState_Locked_c)
    {
        if (lastQ4 >= (int16_t)RSSI_ENTER_NEAR_Q4)
        {
            pCtx->previousState      = pCtx->currentState;
            pCtx->currentState       = RssiState_Approach_c;
            pCtx->tCandidateStartMs  = nowMs;
            pCtx->tBelowExitStartMs  = 0U;
            return RssiEvent_CandidateStarted_c;
        }

        return RssiEvent_None_c;
    }

    /* ---- CANDIDATE state ---- */
    /* Check exit condition: signal below exit for exitConfirmMs */
    if (lastQ4 < (int16_t)RSSI_EXIT_NEAR_Q4)
    {
        if (pCtx->tBelowExitStartMs == 0U)
        {
            pCtx->tBelowExitStartMs = nowMs;
        }

        if (RssiFilter_TimeDiff(nowMs, pCtx->tBelowExitStartMs) >= (uint32_t)RSSI_EXIT_CONFIRM_MS)
        {
            pCtx->previousState      = pCtx->currentState;
            pCtx->currentState       = RssiState_Locked_c;
            pCtx->tBelowExitStartMs  = 0U;
            pCtx->tCandidateStartMs  = 0U;
            return RssiEvent_ExitToFar_c;
        }
    }
    else
    {
        pCtx->tBelowExitStartMs = 0U;
    }

    /* Check unlock condition: stable for stableMs */
    isStable = ((pCtx->features.pctAboveQ15 >= (uint16_t)RSSI_PCT_TH_Q15) &&
                (pCtx->features.stdQ4 <= (uint16_t)RSSI_STD_TH_Q4)) ? 1U : 0U;

    if (isStable != 0U)
    {
        if (RssiFilter_TimeDiff(nowMs, pCtx->tCandidateStartMs) >= (uint32_t)RSSI_STABLE_MS)
        {
            pCtx->previousState      = pCtx->currentState;
            pCtx->currentState       = RssiState_Unlocked_c;
            pCtx->tLockoutUntilMs    = nowMs + (uint32_t)RSSI_LOCKOUT_MS;
            pCtx->tBelowExitStartMs  = 0U;
            return RssiEvent_UnlockTriggered_c;
        }
    }
    else
    {
        /* Reset candidate timer on instability */
        pCtx->tCandidateStartMs = nowMs;
    }

    return RssiEvent_None_c;
}
